In [8]:
# Libs
import pandas as pd

In [9]:
df = pd.read_csv('../jupyter-volume/dataset/original_loan_data_2007_2014.csv')

/home/rtiagos/anaconda3/envs/ds/lib/python3.10/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (20) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 466285 entries, 0 to 466284
Data columns (total 75 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Unnamed: 0                   466285 non-null  int64
 1   id                           466285 non-null  int64
 2   member_id                    466285 non-null  int64
 3   loan_amnt                    466285 non-null  int64
 4   funded_amnt                  466285 non-null  int64
 5   funded_amnt_inv              466285 non-null  float64
 6   term                         466285 non-null  object
 7   int_rate                     466285 non-null  float64
 8   installment                  466285 non-null  float64
 9   grade                        466285 non-null  object
 10  sub_grade                    466285 non-null  object
 11  emp_title                    438697 non-null  object
 12  emp_length                   445277 non-null  object
 13  home_ownership               466285 non-null  object
 14  annual_inc                   466281 non-null  float64
 15  verification_status          466285 non-null  object
 16  issue_d                      466285 non-null  object
 17  loan_status                  466285 non-null  object
 18  pymnt_plan                   466285 non-null  object
 19  url                          466285 non-null  object
 20  desc                         125983 non-null  object
 21  purpose                      466285 non-null  object
 22  title                        466265 non-null  object
 23  zip_code                     466285 non-null  object
 24  addr_state                   466285 non-null  object
 25  dti                          466285 non-null  float64
 26  delinq_2yrs                  466256 non-null  float64
 27  earliest_cr_line             466256 non-null  object
 28  inq_last_6mths               466256 non-null  float64
 29  mths_since_last_delinq       215934 non-null  float64
 30  mths_since_last_record       62638 non-null   float64
 31  open_acc                     466256 non-null  float64
 32  pub_rec                      466256 non-null  float64
 33  revol_bal                    466285 non-null  int64
 34  revol_util                   465945 non-null  float64
 35  total_acc                    466256 non-null  float64
 36  initial_list_status          466285 non-null  object
 37  out_prncp                    466285 non-null  float64
 38  out_prncp_inv                466285 non-null  float64
 39  total_pymnt                  466285 non-null  float64
 40  total_pymnt_inv              466285 non-null  float64
 41  total_rec_prncp              466285 non-null  float64
 42  total_rec_int                466285 non-null  float64
 43  total_rec_late_fee           466285 non-null  float64
 44  recoveries                   466285 non-null  float64
 45  collection_recovery_fee      466285 non-null  float64
 46  last_pymnt_d                 465909 non-null  object
 47  last_pymnt_amnt              466285 non-null  float64
 48  next_pymnt_d                 239071 non-null  object
 49  last_credit_pull_d           466243 non-null  object
 50  collections_12_mths_ex_med   466140 non-null  float64
 51  mths_since_last_major_derog  98974 non-null   float64
 52  policy_code                  466285 non-null  int64
 53  application_type             466285 non-null  object
 54  annual_inc_joint             0 non-null       float64
 55  dti_joint                    0 non-null       float64
 56  verification_status_joint    0 non-null       float64
 57  acc_now_delinq               466256 non-null  float64
 58  tot_coll_amt                 396009 non-null  float64
 59  tot_cur_bal                  396009 non-null  float64
 60  open_acc_6m                  0 non-null       float64
 61  open_il_6m                   0 non-null       float64
 62  open_il_12m                  0 non-null       float64
 63  open_il_24m                  0 non-null       float64
 64  mths_since_rcnt_il           0 non-null       float64
 65  total_bal_il                 0 non-null       float64
 66  il_util                      0 non-null       float64
 67  open_rv_12m                  0 non-null       float64
 68  open_rv_24m                  0 non-null       float64
 69  max_bal_bc                   0 non-null       float64
 70  all_util                     0 non-null       float64
 71  total_rev_hi_lim             396009 non-null  float64
 72  inq_fi                       0 non-null       float64
 73  total_cu_tl                  0 non-null       float64
 74  inq_last_12m                 0 non-null       float64
dtypes: float64(46), int64(7), object(22)
memory usage: 266.8+ MB

In [11]:
df = df.drop(['Unnamed: 0'], axis = 1)
df.head()

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,total_bal_il,il_util,open_rv_12m,open_rv_24m,max_bal_bc,all_util,total_rev_hi_lim,inq_fi,total_cu_tl,inq_last_12m
0,1077501,1296599,5000,5000,4975.0,36 months,10.65,162.87,B,B2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1077430,1314167,2500,2500,2500.0,60 months,15.27,59.83,C,C4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1077175,1313524,2400,2400,2400.0,36 months,15.96,84.33,C,C5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1076863,1277178,10000,10000,10000.0,36 months,13.49,339.31,C,C1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1075358,1311748,3000,3000,3000.0,60 months,12.69,67.79,B,B5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 1 - Install MySQL connector module

In [12]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /home/rtiagos/anaconda3/envs/ds/lib/python3.10/site-packages (8.0.27)
Requirement already satisfied: protobuf>=3.0.0 in /home/rtiagos/anaconda3/envs/ds/lib/python3.10/site-packages (from mysql-connector-python) (3.19.1)

In [13]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /home/rtiagos/anaconda3/envs/ds/lib/python3.10/site-packages (1.4.27)
Requirement already satisfied: greenlet!=0.4.17 in /home/rtiagos/anaconda3/envs/ds/lib/python3.10/site-packages (from sqlalchemy) (1.1.2)

### 2 - Import MySQL connector module

In [14]:
import mysql.connector

### 3 - Import MySQL connector module

Use the connect() method of the MySQL Connector class with the required arguments to connect MySQL. It would return a MySQLConnection object if the connection established successfully

### 4 - Use the cursor() method
Use the cursor() method of a MySQLConnection object to create a cursor object to perform various SQL operations.

### 5 - Use the execute() method

### 6 - Extract result using fetchall()

Use cursor.fetchall() or fetchone() or fetchmany() to read query result.

### 7 - Close cursor and connection objects

use cursor.clsoe() and connection.clsoe() method to close open connections after your work completes

###  Examples

In [7]:
# How to connect

In [3]:
import mysql.connector
from mysql.connector import Error

In [4]:
try:
    connection = mysql.connector.connect(host = 'localhost',
                                         database = 'LendingClub',
                                         user = 'root',
                                         password = '0612',
                                         port = 3307)
    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        cursor.execute("select database();")
        record =  cursor.fetchone()
        print("You're connected to database ", record)
        
except Error as e:
    print("Error while connecting to MySQL", e)

finally:
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL Server version  5.7.35
You're connected to database  ('LendingClub',)
MySQL connection is closed

In [ ]:
# How to create a table

import mysql.connector

try:
    connection = mysql.connector.connect(host='localhost',
                                         database='Electronics',
                                         user='pynative',
                                         password='pynative@#29')

    mySql_Create_Table_Query = """CREATE TABLE Laptop ( 
                             Id int(11) NOT NULL,
                             Name varchar(250) NOT NULL,
                             Price float NOT NULL,
                             Purchase_date Date NOT NULL,
                             PRIMARY KEY (Id)) """

    cursor = connection.cursor()
    result = cursor.execute(mySql_Create_Table_Query)
    print("Laptop Table created successfully ")

except mysql.connector.Error as error:
    print("Failed to create table in MySQL: {}".format(error))
finally:
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

In [10]:
# How to QUERY

try:
    connection = mysql.connector.connect(host = 'localhost',
                                         database = 'sys',
                                         user = 'root',
                                         password = '0612')
    sql_select_query = 'SELECT * FROM sys_config'
    cursor = connection.cursor()
    cursor.execute(sql_select_query)
    
    # get all records
    
    records = cursor.fetchall()
    print("Total number of rows in table: ", cursor.rowcount)
    
    print("\n Printing each row")
    for row in records:
        print("Id = ", row[0])
        print("Teste = ", row[1])
except mysql.connector.Error as e:
    print("Error reading data from MySQL table ", e)
    
finally:
    if connection.is_connected():
        connection.close()
        cursor.close()
        print("MySQL connection is closed")

Total number of rows in table:  6

 Printing each row
Id =  diagnostics.allow_i_s_tables
Teste =  OFF
Id =  diagnostics.include_raw
Teste =  OFF
Id =  ps_thread_trx_info.max_length
Teste =  65535
Id =  statement_performance_analyzer.limit
Teste =  100
Id =  statement_performance_analyzer.view
Teste =  None
Id =  statement_truncate_len
Teste =  64
MySQL connection is closed

In [18]:
# How to insert

features = 'member_id loan_amnt funded_amnt funded_amnt_inv grade sub_grade int_rate annual_inc issue_d loan_status addr_state mths_since_last_delinq recoveries annual_inc_joint tot_coll_amt emp_length issue_d earliest_cr_line term'.split()
features

['member_id',
 'loan_amnt',
 'funded_amnt',
 'funded_amnt_inv',
 'grade',
 'sub_grade',
 'int_rate',
 'annual_inc',
 'issue_d',
 'loan_status',
 'addr_state',
 'mths_since_last_delinq',
 'recoveries',
 'annual_inc_joint',
 'tot_coll_amt',
 'emp_length',
 'issue_d',
 'earliest_cr_line',
 'term']

In [85]:
def sql_insert(df, table):
    
    columns = df.index[0]
    
    values = str(df.values[0])
    
    for col, val in zip(df.index[1:-1], df.values[1:-1]):
        
        columns = columns + ', ' + col
        values = values + ', ' + str(val)
        
    return f'INSERT INTO {table} ({columns}) VALUES ({values})'

In [86]:
for i in df[features].index[0:4]:
    
    print(sql_insert(df[features].loc[i], 'LendingClub'))

INSERT INTO LendingClub (member_id, loan_amnt, funded_amnt, funded_amnt_inv, grade, sub_grade, int_rate, annual_inc, issue_d, loan_status, addr_state, mths_since_last_delinq, recoveries, annual_inc_joint, tot_coll_amt, emp_length, issue_d, earliest_cr_line) VALUES (1296599, 5000, 5000, 4975.0, B, B2, 10.65, 24000.0, Dec-11, Fully Paid, AZ, nan, 0.0, nan, nan, 10+ years, Dec-11, Jan-85)
INSERT INTO LendingClub (member_id, loan_amnt, funded_amnt, funded_amnt_inv, grade, sub_grade, int_rate, annual_inc, issue_d, loan_status, addr_state, mths_since_last_delinq, recoveries, annual_inc_joint, tot_coll_amt, emp_length, issue_d, earliest_cr_line) VALUES (1314167, 2500, 2500, 2500.0, C, C4, 15.27, 30000.0, Dec-11, Charged Off, GA, nan, 117.08, nan, nan, < 1 year, Dec-11, Apr-99)
INSERT INTO LendingClub (member_id, loan_amnt, funded_amnt, funded_amnt_inv, grade, sub_grade, int_rate, annual_inc, issue_d, loan_status, addr_state, mths_since_last_delinq, recoveries, annual_inc_joint, tot_coll_amt, emp_length, issue_d, earliest_cr_line) VALUES (1313524, 2400, 2400, 2400.0, C, C5, 15.96, 12252.0, Dec-11, Fully Paid, IL, nan, 0.0, nan, nan, 10+ years, Dec-11, Nov-01)
INSERT INTO LendingClub (member_id, loan_amnt, funded_amnt, funded_amnt_inv, grade, sub_grade, int_rate, annual_inc, issue_d, loan_status, addr_state, mths_since_last_delinq, recoveries, annual_inc_joint, tot_coll_amt, emp_length, issue_d, earliest_cr_line) VALUES (1277178, 10000, 10000, 10000.0, C, C1, 13.49, 49200.0, Dec-11, Fully Paid, CA, 35.0, 0.0, nan, nan, 10+ years, Dec-11, Feb-96)

### DataFrame to MySQL database

In [15]:
host = 'localhost',
database = 'LendingClub',
user = 'root',
password = '0612'

In [16]:
import sqlalchemy

In [19]:
database_username = 'root'
database_password = '0612'
database_ip       = 'localhost:3307'
database_name     = 'sys'
database_connection = sqlalchemy.create_engine('mysql+mysqlconnector://{0}:{1}@{2}/{3}'.
                                               format(database_username, database_password, 
                                                      database_ip, database_name))

In [ ]:
df.to_sql(con=database_connection, name='lending_club_2007_2014', if_exists='replace')